% ---------------矩阵---------------
m = [1,2,3; 4,5,6; 7,8,9]

% 数组
a = [1,2,3,4,5]
a = [1 3 5 9 7]
% 创建矩阵
m0 = zeros(3,3)
m1 = ones(3,3)
m2 = rand(3,3)
m3 = randn(3,3)
% 转置矩阵
m = m'

% 水平串联和垂直串联
n = zeros(3,3)
[m,n]
[m;n]

% 矩阵运算
a = [1,2,3; 4,5,6; 7,7,8]
a*3
a+a
a*a
a.*a

% 索引运算
a = [1,2,3; 4,5,6; 7,7,8]
a(1,1)
a(4,4) = 5
a(2:4,1:3)
a(3,:)

% 等距离矢量
m = [0:10:100]

% ---------------文本和字符---------------
text = 'This is a ''special'' date'

% 查看变量类型
whos text

% 连接字符串
hello = 'How are you ?'
[text, '. ', hello]

% 字符与数字转换
c = '1'
n = 1
num2str(n)
str2num(c)

